[{"review":"the Play Now button for entering monopoly codes doesn't work, so there's no way to scan codes or redeem points.","category":"UI\/UX","sentiment_std":"Negative","rating":1,"review_date":"2025-10-26","source":"Google Play","app_version":"25.84.0"},{"review":"Every description of the current monopoly game say to go to this app and click the \"Monopoly promotional banner\", but there is none! I am signed in and have searched the whole app. So frustrating! Especially since they are promoting the \"double play\" feature this time around.","category":"UI\/UX","sentiment_std":"Negative","rating":2,"review_date":"2025-10-26","source":"Google Play","app_version":"25.84.0"},{"review":"Monopoly suddenly stopped working. The button to scan codes is still there but seems to have been disabled.","category":"UI\/UX","sentiment_std":"Negative","rating":2,"review_date":"2025-10-26","source":"Google Play","app_version":"25.84.0"},{"review":"Beyond doubt the absolute *worst* rewards app I've ever used. Bloated, slow, laggy, confusing, convoluted, unintuitive, unresponsive, it's effectively unusable. It's terrible in every way conceivable on every level imaginable, and I am to no degree exaggerating.","category":"Rewards\/Offers","sentiment_std":"Negative","rating":1,"review_date":"2025-10-26","source":"Google Play","app_version":"25.84.0"},{"review":"I don't get the option to finish my order","category":"Payments","sentiment_std":"Negative","rating":5,"review_date":"2025-10-26","source":"Google Play","app_version":"25.84.0"},{"review":"Glitchy. Shows where to enter monopoly points but tab didn't work. Tried uninstalling but the only option to log back into the app is through email which also isn't working. I know my login and password but that's not even an option to log in. Just overall bad performance and planning on this one.","category":"UI\/UX","sentiment_std":"Negative","rating":1,"review_date":"2025-10-26","source":"Google Play","app_version":"25.84.0"},{"review":"Oct. 2025 - update. Frequently signed out automatically. Not getting email with link. Unable to sign in for anything AT ALL!!!. This app is just a garbage. And selecting location is a joke. Nov. 2018 -Unable to log in, keep loading but never works. Aweful app.","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":1,"review_date":"2025-10-26","source":"Google Play","app_version":"25.84.0"},{"review":"constantly freezes and takes forever to load any screen","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":1,"review_date":"2025-10-26","source":"Google Play","app_version":"25.84.0"},{"review":"It says my device isn't compatible with the app. So how am I gonna play Monopoly double play now?","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":1,"review_date":"2025-10-26","source":"Google Play","app_version":null},{"review":"Repeatedly have to sign in. And now I'm unable to sign in at all, email with link never shows up. Yes, I'm checking my junk mail as well.","category":"Authentication\/Login","sentiment_std":"Negative","rating":3,"review_date":"2025-10-26","source":"Google Play","app_version":"25.84.0"},{"review":"Recently this app started randomly logging me out. This wouldn’t be so bad if I was able to just log back in with an email and password. The problem is, to log in, they just send a link to your email to click on - except they don’t. I request a link and it never comes, or sometimes it comes hours later. Yes I’ve checked my spam, no it’s not there. Go back to a normal user\/password like 99% of other apps.","category":"UI\/UX","sentiment_std":"Negative","rating":1,"review_date":"2025-10-25","source":"App Store","app_version":"25.84.2"},{"review":"McDonald’s app has gotten bloated and glitchy. It often takes too long to load and get past the glitches, so would be faster to skip the app and use a human cashier.\n\nWhen the app has an error there is no way to get your money refunded. I changed the location to where I actually was and placed my order. App finalized the order at my previous location from the day before and made the order in another city! Staff said there was nothing they could do and no refunds. Once they have your money they are keeping it even if you don’t receive your food. Thieves!!!!!!","category":"Refunds","sentiment_std":"Negative","rating":1,"review_date":"2025-10-25","source":"App Store","app_version":"25.84.2"},{"review":"Refuses to focus on the codes when trying to scan them","category":"Performance\/Speed","sentiment_std":"Neutral","rating":1,"review_date":"2025-10-24","source":"App Store","app_version":"25.84.2"},{"review":"Doesn’t show error. But Visa credit card is not getting charged. End up paying at the restaurant despite Apple Pay payment attempt in mobile order. Also why can’t I place my mobile order and say my name to the speaker instead of the weird alpha-numerals?","category":"UI\/UX","sentiment_std":"Negative","rating":3,"review_date":"2025-10-24","source":"App Store","app_version":"25.84.2"},{"review":"I can never log in anymore as they don’t use passwords, they send an email, but it never sends, so I can’t access my McDonalds account anymore which means no McDonald monopoly play. And contacting them about their app is impossible","category":"Authentication\/Login","sentiment_std":"Negative","rating":2,"review_date":"2025-10-24","source":"App Store","app_version":"25.84.2"},{"review":"The recent update broke login. I can only login via email but the email wasn’t sent after a number of repeat. I checked the spam folder.","category":"Authentication\/Login","sentiment_std":"Negative","rating":1,"review_date":"2025-10-24","source":"App Store","app_version":"25.84.2"},{"review":"Mcdonalds keeps signing me out of my app and wont let me use my code even though everything was fine. I took my money elsewhere.","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":1,"review_date":"2025-10-24","source":"App Store","app_version":"25.84.2"},{"review":"Not sure what is happening but the last several times I’ve gone through the drive-thru, the code doesn’t work. Says invalid. When I close the app or try to refresh, it keeps giving me the same code.","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":3,"review_date":"2025-10-24","source":"App Store","app_version":"25.84.2"},{"review":"Prepare to open the app an hour before your trip to a McDonald’s because the app will glitch and freeze a hundred and one times before it decides to work :)","category":"Crashes\/Bugs","sentiment_std":"Neutral","rating":1,"review_date":"2025-10-24","source":"App Store","app_version":"25.84.2"},{"review":"Used to work well. Now it's just garbage on my phone! Won't even find restaurant locations.","category":"Payments","sentiment_std":"Negative","rating":1,"review_date":"2025-10-24","source":"App Store","app_version":"25.84.2"}]