[{"review":"Monopoly not working in app. I always upload all my monopoly double play stickers but this year the monopoly section won't even open for me. Very frustrating!","category":"UI\/UX","sentiment_std":"Negative","rating":1,"review_date":"2025-11-07","source":"Google Play","app_version":"25.84.0"},{"review":"I can't even log in with my email, it just says my email already exists everytime... I know that mcdonalds thanks I would like to log in with that email please but nope no option at all. only option on the app is to create an account in the log in page. really appreciate it mcds","category":"Authentication\/Login","sentiment_std":"Negative","rating":1,"review_date":"2025-11-07","source":"Google Play","app_version":"25.84.0"},{"review":"Was great... but now. I keep trying to login and it asks me my email... press send and never get my email code to login. Not in my spam. Not in my junk. NOTHING! Tried with my alternate email and NOPE... ZIP... NADA... NOTHING. Bye bye all my points. I guess on the upside... made me skip my very frequent weekly visit to my local McDonald's to my wallet and stomach's advantage.","category":"Authentication\/Login","sentiment_std":"Negative","rating":1,"review_date":"2025-11-07","source":"Google Play","app_version":"25.84.0"},{"review":"this app was working really good and today it stopped working. I got signed out and can't sign back in. so now I am going to lose all the points that I earned.","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":1,"review_date":"2025-11-07","source":"Google Play","app_version":null},{"review":"order just straight uo wasnt delivered. i used the last $20 dollars i had to get a snack. they refused to just send a new order or give me credit, so im now having to wait days ti get my refund","category":"Refunds","sentiment_std":"Negative","rating":1,"review_date":"2025-11-07","source":"Google Play","app_version":null},{"review":"cant use play now function for monopoly","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":1,"review_date":"2025-11-07","source":"Google Play","app_version":"25.84.0"},{"review":"Useless stupid app. Half the time it sits there hung, and then they won't accept the offers at the drive through, claiming its been used already. Which is impossible since I'm sitting in the drive through fighting with the app. How is this app so terrible with the resources McDonald's has available to them?","category":"Rewards\/Offers","sentiment_std":"Negative","rating":1,"review_date":"2025-11-07","source":"Google Play","app_version":"25.84.0"}]