[{"review":"the app refuses to show the mcdonalds game after you use it to order... until you close it and open it several times.","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":2,"review_date":"2025-10-31","source":"Google Play","app_version":"25.84.0"},{"review":"can't sign in anymore. it says it sent an email but the email never arrives in my inbox or spam folder","category":"Authentication\/Login","sentiment_std":"Negative","rating":1,"review_date":"2025-10-31","source":"Google Play","app_version":"9.105.3"},{"review":"it just dosnt work sometimes and I can't even access to monopoly double play","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":2,"review_date":"2025-10-31","source":"Google Play","app_version":"25.84.0"},{"review":"the app hasn't work since yesterday well the monopoly part of it.. should I just delete it.. I am loosing my patience with it...","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":1,"review_date":"2025-10-31","source":"Google Play","app_version":"25.84.0"},{"review":"the monopoly game part of my app wasn't working - nothing happened when I tapped the buttons to open the game. I contacted McDonald's about it and was told to log out, clear my cache, and that would make it work. I did that and now I am unable to log back in. when I try, it says it will send me an email and I have to click the email link to log in. no email ever comes. and now McDonald's isnt replying to my email request for help. I have points about to expire that I can't access to use.","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":1,"review_date":"2025-10-31","source":"Google Play","app_version":"25.84.0"},{"review":"Slow to load and laggy","category":"Performance\/Speed","sentiment_std":"Negative","rating":1,"review_date":"2025-10-31","source":"Google Play","app_version":"9.105.2"},{"review":"What is happening here. Before the Monopoly play, the App was perfect. Almost flawless. Then it changed substantially for the worst. Why do I need to confirm 3 times for the location I chose? Why does it memorize how I received my order - I've had to get my order several times inside, even tho I meant drive thru. Why can't I select to eat-in instead of getting a large takeout bag. The Monopoly interface is a joke. It only comes back to entering codes after a half day (yes, I've reset my app)","category":"UI\/UX","sentiment_std":"Negative","rating":2,"review_date":"2025-10-31","source":"Google Play","app_version":"25.84.0"},{"review":"terrible app, never works right and always has features missing","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":1,"review_date":"2025-10-31","source":"Google Play","app_version":null},{"review":"why can't I save a gift card and\/or pay with a gift card in app?","category":"UI\/UX","sentiment_std":"Neutral","rating":3,"review_date":"2025-10-31","source":"Google Play","app_version":"25.84.0"},{"review":"Doesn't even work. Buttons won't click and screen won't scroll. Stuck at top of main screen with nothing to do. This app used to work great and McDonald's used to have great deals. Now the app is non-functional and there aren't any deals. The company fell off hard; now I just go to Wendy's where the app works great and the deals are common and fantastic.","category":"UI\/UX","sentiment_std":"Negative","rating":1,"review_date":"2025-10-31","source":"Google Play","app_version":"25.84.0"},{"review":"Won't let me sign in, says sent email but nothing comes. I checked spam and everything. WHY DOES THIS APP ONLY WORK SOMETIMES?!","category":"Authentication\/Login","sentiment_std":"Negative","rating":1,"review_date":"2025-10-31","source":"Google Play","app_version":"25.84.0"}]