[{"review":"what a horrible experience. i wanted to pay cash at the window 10.91 with the coupon price, the app was obliging me to add my credit card information. I decided to go drive thru, show the app price and say I wanted to pay cash. impossible to do. paying cash the same trio was 13.27 instead of 10.91. I dont go to McDonald's as much as I used to because I find the prices for food are too steap but now I am absolutely done and will not be going back again. you've now lost me completely.","category":"Payments","sentiment_std":"Negative","rating":1,"review_date":"2026-01-07","source":"Google Play","app_version":"25.111.0"},{"review":"app is broken, won't register new device","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":1,"review_date":"2026-01-07","source":"Google Play","app_version":"25.111.0"},{"review":"HELP FOR THE USERS: you need to clear your cache and local storage for the app to work. I STAND BY MY STATEMENT: YOUR DEVS ARE IDIOTS. It seems like whomever was QA was drunk, absent, or both. Same with the UX and UI designer. Your company wonders why the app is getting low ratings for so long? For a company your size not to venture into mobile properly is suicide. Update, bonus feature. If you set your location add to your cart it will change your store if you move before you checkout.","category":"UI\/UX","sentiment_std":"Negative","rating":1,"review_date":"2026-01-07","source":"Google Play","app_version":"25.111.0"},{"review":"stop showing up on my feed, your restaurant serves absolute garbage","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":1,"review_date":"2026-01-07","source":"Google Play","app_version":null},{"review":"Not bad, but one major annoyance... if the two of you are having the same breakfast, it won't let you customize your coffees. It'll let you change one, but then it changes all the coffees to be the same. It won't let one of you have a decaffeinated - it makes both orders decaffs!","category":"UI\/UX","sentiment_std":"Negative","rating":5,"review_date":"2026-01-07","source":"Google Play","app_version":"25.111.0"}]