[{"review":"after an update I was logged out of my app and now the app doesn't let me log in it says its going to send me an email and I don't need to put my password in, then I wait and no email even when I request a new email. I've already uninstalled the app and then reinstalled it and still same issue, over all I'm not making a new account or reinstalling the app unless its fixed, even after my Monopoly progress was okay on the app to so not satisfied with McDonald's right now.","category":"Authentication\/Login","sentiment_std":"Negative","rating":1,"review_date":"2025-11-02","source":"Google Play","app_version":"9.105.3"},{"review":"The Monopoly feature is nowhere to be found even though I've used it several times before. Had to force stop the app then restart it to get the Monopoly feature, now even that doesn't work.","category":"UI\/UX","sentiment_std":"Negative","rating":1,"review_date":"2025-11-02","source":"Google Play","app_version":"25.84.0"},{"review":"Ordering only by app? Why do I have to download this clown's app to order online. Not possible by website? Gave up and went somewhere else.","category":"UI\/UX","sentiment_std":"Negative","rating":1,"review_date":"2025-11-02","source":"Google Play","app_version":null},{"review":"Can't log in my account.","category":"Authentication\/Login","sentiment_std":"Negative","rating":1,"review_date":"2025-11-02","source":"Google Play","app_version":"25.84.0"},{"review":"very glitchy app doesn't always work. the deals were nice in the beginning but kind went to 💩 and the rewards system are getting more stingey with the point values (eg 4000 points for lrg coffee). still the best way to get your order out tho without trying to describe it in the drive thru","category":"Rewards\/Offers","sentiment_std":"Negative","rating":2,"review_date":"2025-11-02","source":"Google Play","app_version":"25.84.0"},{"review":"I was forced to update while I was trying to place an order. Needed a link emailed to be able to log in but it was never sent. I tried over and over on multiple days. Even uninstalling and reinstalling didn't work. Since I can't actually use the app I'd give it zero stars if I could.","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":1,"review_date":"2025-11-02","source":"Google Play","app_version":"9.3.0"},{"review":"Points don't even get large coffee anymore they only give medium. Prices are through the roof, why even bother anymore...","category":"Payments","sentiment_std":"Negative","rating":1,"review_date":"2025-11-02","source":"Google Play","app_version":"25.84.0"},{"review":"xan not scan double play","category":"Delivery","sentiment_std":"Neutral","rating":5,"review_date":"2025-11-02","source":"Google Play","app_version":"25.84.0"},{"review":"I can't sign in. It won't send the link through email","category":"Authentication\/Login","sentiment_std":"Negative","rating":1,"review_date":"2025-11-02","source":"Google Play","app_version":"25.84.0"}]