[{"review":"slow,glitchy, doesn't let me redeem point sometimes","category":"Rewards\/Offers","sentiment_std":"Negative","rating":1,"review_date":"2025-10-16"},{"review":"will no longer take payment","category":"Payments","sentiment_std":"Neutral","rating":1,"review_date":"2025-10-12"},{"review":"crashes often. takes a long time to load offers. monopoly won't even open.","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":1,"review_date":"2025-10-11"},{"review":"confusing","category":"Crashes\/Bugs","sentiment_std":"Neutral","rating":5,"review_date":"2025-10-10"},{"review":"never works","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":1,"review_date":"2025-10-08"},{"review":"Love it","category":"Rewards\/Offers","sentiment_std":"Positive","rating":5,"review_date":"2025-09-30"},{"review":"ok","category":"Rewards\/Offers","sentiment_std":"Neutral","rating":4,"review_date":"2025-09-30"},{"review":"Really glitchy on android.","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":1,"review_date":"2025-09-29"},{"review":"ripped me off almost $8.00, so I'm never going into a McDonalds ever again!!!","category":"Payments","sentiment_std":"Negative","rating":1,"review_date":"2025-09-26"},{"review":"wonderful, great breakfast","category":"Rewards\/Offers","sentiment_std":"Positive","rating":5,"review_date":"2025-09-26"},{"review":"My comments are just joining all the rest that hate that this app is so slow loading, makes the checking menu and ordering process painful, plus not offering much in 'your offers'. App takes forever to open, then tells you not to use while driving every time. You pretty well need to know exactly what you're ordering, or keep ordering whatever you had the last time, to get through the ordering with your sanity! Customizing orders tough! Contact McD online form just as tough! On purpose !?!?","category":"UI\/UX","sentiment_std":"Negative","rating":1,"review_date":"2025-09-26"},{"review":"app is still garbage. will give code but code not accepted at terminal. app rately gives a valid code and means I am not able to get dollar drinks or cones.","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":1,"review_date":"2025-09-25"},{"review":"I no longer buy coffee or anything else from McDonald's.","category":"Performance\/Speed","sentiment_std":"Negative","rating":3,"review_date":"2025-09-24"},{"review":"good","category":"Rewards\/Offers","sentiment_std":"Positive","rating":5,"review_date":"2025-09-24"},{"review":"This is an amazing app.I use it all the time i find that McDonald's is the amazing up to be using at McDonald's for the simple reason. Now it's easy to use, and I recommend that everybody does use it for the simple reason, not everybody can use a hard app. So people use this one because it is very understanding to use And people love it","category":"Delivery","sentiment_std":"Positive","rating":5,"review_date":"2025-09-24"},{"review":"Worst app ever. Incredibely slow. A lot of bugs. I hate offering trough this app.","category":"Performance\/Speed","sentiment_std":"Negative","rating":1,"review_date":"2025-09-23"},{"review":"good app","category":"UI\/UX","sentiment_std":"Positive","rating":5,"review_date":"2025-09-23"},{"review":"1 star is being f@#$ing generous. Not only would the app not work right, and I ended up having to abandon my order to catch my train, but when I attempted to enter a complaint, I had to abandon that after the second attempt because it requires restaurant number off receipt which I didn't get or from a location field which doesn't work worth shite. Unf@#$ing believable. Mcdonald's, you need to be better than this.","category":"UI\/UX","sentiment_std":"Negative","rating":1,"review_date":"2025-09-20"},{"review":"these cheap crooks make you claw and beg for points using their system and then they go ahead and water your points down incredibly like the large fry that you can no longer get for $4,000 points you can only get small and medium and you have to spend $6,000 points on a large fry I'm done being bent over and screwed by Ronald McDonald. you guys are messed up.","category":"Payments","sentiment_std":"Negative","rating":1,"review_date":"2025-09-19"},{"review":"McDonald's just recently scaled down their rewards. I used to be able to get an any size coffee with 2000 points now all I can get is a smaller medium this is another form of shrinkflation a sneaky way for McDonald's to increase their prices. I am officially done with McDonald's app uninstalled.","category":"Rewards\/Offers","sentiment_std":"Negative","rating":1,"review_date":"2025-09-19"},{"review":"The app is garbage. The location doesn't even work. after 11 years it's still garbage","category":"Location\/Geolocation","sentiment_std":"Negative","rating":1,"review_date":"2025-09-19"},{"review":"im really giving no stars. fix this app. advanced ordering is not working. McDonald's doesn't care to fix.","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":1,"review_date":"2025-09-19"},{"review":"this app is gone from bad to worst! constantly crashes or won't load. and now the reward system is not even worth it! they've changed it for the worst, E.G. before 2000 points got you an extra large coffee; now it's 6000 points! between that and the poor stability of the app it's time to not bother using it or going there anymore.... switching to BK... their app works great!","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":2,"review_date":"2025-09-19"},{"review":"this app constantly fails and crashes out","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":1,"review_date":"2025-09-19"},{"review":"I just updated the app, it's now asking me to register again. I use the same email and now all my points are lost.","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":2,"review_date":"2025-09-19"},{"review":"The app never works for me..it keeps saying I already have an order. very poor app","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":1,"review_date":"2025-09-18"},{"review":"scam \/ promo dont work","category":"Rewards\/Offers","sentiment_std":"Negative","rating":1,"review_date":"2025-09-18"},{"review":"keeps getting worse first credit card issues now it always changes the location and doesn't let your order go through roll back whatever updates you did its unusable","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":1,"review_date":"2025-09-18"},{"review":"sooo many glitches that render the app useless it's not even funny. The checkout in particular often breaks so bad for me I can't place any orders, doesn't matter if I log out and back in or reinstall the app. rarely ever get decent coupons anymore either","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":1,"review_date":"2025-09-18"},{"review":"This app is atrocious. Why does it take SO MANY CLICKS just to order. Why do I need to authorize payment THREE TIMES - the last one after I have to tell it I need a bag, which for some reason I can't do until I'm at the store waiting. it would be hard to have a more painful UX if they tried.","category":"UI\/UX","sentiment_std":"Negative","rating":1,"review_date":"2025-09-18"},{"review":"not the greatest app. I placed an order for one restaurant and it went through to another restaurant twice now. Both times it was two totally different locations that I was ordering from and where it showed up. they were both 15-20km away from each other.","category":"UI\/UX","sentiment_std":"Negative","rating":2,"review_date":"2025-09-17"},{"review":"they doubled the stars required for a large coffee to 4000 💔","category":"Rewards\/Offers","sentiment_std":"Negative","rating":1,"review_date":"2025-09-17"},{"review":"Doesn't open","category":"Crashes\/Bugs","sentiment_std":"Neutral","rating":4,"review_date":"2025-09-17"},{"review":"Why do points expire? That's a disappointing feature to get people to order as opposed to offering incentives for consecutive day usage","category":"Rewards\/Offers","sentiment_std":"Negative","rating":1,"review_date":"2025-09-17"},{"review":"horrible. wasting our time","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":1,"review_date":"2025-09-17"},{"review":"Placed an online order via the app, paid via the app, went to the window, and was charged an extra 6.21. Surprise, your 29.44 paid for order is now, all of a sudden, 35.65. Greedy, sneaky bas tards.","category":"Payments","sentiment_std":"Negative","rating":1,"review_date":"2025-09-17"},{"review":"extremely hard to use. unresponsive and often results in wrong clicks.","category":"UI\/UX","sentiment_std":"Negative","rating":2,"review_date":"2025-09-17"},{"review":"Incapable de me reconnecter... ce n'est pas la 1ère fois que l'application me déconnecte et ne me laisse plus accéder à mon compte. La dernière fois j' ai dû recommencer avec une nouvelle adresse mail et tous mes points ont été perdus.","category":"Crashes\/Bugs","sentiment_std":"Neutral","rating":1,"review_date":"2025-09-17"},{"review":"this app should be worked on whe I try to order food I start to pick what I want it tells upps something went wrong start again it seams that it has it go to pay kicks me out and I have to start from the beginning sometimes I don't want to because it may produce 2 orders instead of one like last night everything went ok till I got to the restaurant and the told me that there wasn't a order from me the girl checked again she said again no sir no order is been place from you so I did it again","category":"Payments","sentiment_std":"Negative","rating":2,"review_date":"2025-09-16"},{"review":"This is the worst company to have to deal with. Their customer service agents don't read and understand English so they don't help you. I had so many bad experiences and you can't trust the mobile ordering. Once they had a problem with a machine and they refused to refund the order of a bad drink. Half the time the coffee machine is not working so I'm done. I deleted my account and happy to never use this app ever again!","category":"Customer Support","sentiment_std":"Negative","rating":1,"review_date":"2025-09-16"},{"review":"🌮🫔 barbie dollars a month for a year youtube is a great place to be successful ×@¤×@÷+","category":"Rewards\/Offers","sentiment_std":"Positive","rating":5,"review_date":"2025-09-15"},{"review":"this app always says i have an order in progress yet I don't and then I'm unable to place an order.. bugged","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":1,"review_date":"2025-09-15"},{"review":"Not great. Get a notification, but when I click on it, I get the message \"This offer is not valid today\"....","category":"Rewards\/Offers","sentiment_std":"Negative","rating":1,"review_date":"2025-09-15"},{"review":"garbage app. hasn't worked in at least a month. gives me a warning ⚠️ to check the offer in my bag but there's nothing there, and because of that I can't checkout. Does anybody even care anymore?","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":1,"review_date":"2025-09-15"},{"review":"One of the worst fast food apps I have had the displeasure of using. Its painfully slow. Even when it does load it doesn't allow even the most basic choices to be made by the customer. If you want to order a milkshake on delivery, the app may just arbitrarily choose a location which is not currently serving milkshakes. There is no way to change which store it will give your delivery order to, it actively prevents you from placing your order.","category":"Performance\/Speed","sentiment_std":"Negative","rating":1,"review_date":"2025-09-15"},{"review":"Worst reward app in existence! it doesn't work correctly, damands your location to function and it's impossible to reset the code to get your rewards. multiple times I have had issues with the barcode\/ 4 digit number and not once has a solution been given for fixing the issue. instead you just lose out on reward points or redemption","category":"Location\/Geolocation","sentiment_std":"Negative","rating":1,"review_date":"2025-09-14"},{"review":"Annoying! The app always have to open two times. the first time it will automatically close and only the second time will stay open. Why?","category":"UI\/UX","sentiment_std":"Negative","rating":1,"review_date":"2025-09-14"},{"review":"I will say, this app, is so use full as my 5 grandchildren love to eat here so points add up, plus I love the coffee as well!!","category":"Rewards\/Offers","sentiment_std":"Positive","rating":5,"review_date":"2025-09-14"},{"review":"Non-functional comments section.","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":1,"review_date":"2025-09-14"},{"review":"difficult to use, had to go in person to order","category":"Payments","sentiment_std":"Negative","rating":1,"review_date":"2025-09-14"},{"review":"app is complete junk. sat for 15 minutes trying to put in a simple order with the app being buggy and just not working.","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":1,"review_date":"2025-09-13"},{"review":"Constantly glitches, the rewards\/points page often wont load and stays blank. Also, if they happen to forget AN ENTIRE MEAL within your order, they ONLY refund you for the missing food. They keep the tax you paid AND the 11% service fees you paid for said food. Cost me extra to reorder the food they should have sent with the driver the first time. Oh and I had to tip the second driver, so even more incurred costs for me.","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":2,"review_date":"2025-09-13"},{"review":"lots of recent bugs that stop you from ordering even after force stopping the app. Must keep uninstalling and redownload to fix","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":1,"review_date":"2025-09-13"},{"review":"but why does it lag like crazy?","category":"Performance\/Speed","sentiment_std":"Negative","rating":5,"review_date":"2025-09-13"},{"review":"So complicated APP, can not order before it arrives at the place. No use for rush order..","category":"Performance\/Speed","sentiment_std":"Negative","rating":1,"review_date":"2025-09-12"},{"review":"one of the worst apps I have ever had the displeasure of using.","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":1,"review_date":"2025-09-12"},{"review":"Extremely slow and loves to crash. I used to endure this app in order to access it's deals, but I haven't seen an actual usable coupon in months. I'm not messing around with this barely functional app to redeem it's absolutely useless coupons anymore, what happened to the $10 Big Mac meals?","category":"Performance\/Speed","sentiment_std":"Negative","rating":1,"review_date":"2025-09-12"},{"review":"does not let me use my points","category":"Rewards\/Offers","sentiment_std":"Negative","rating":1,"review_date":"2025-09-11"},{"review":"changes pick up location to a city 5 hours away. Tried to make order and item listed not available once I reached the location. Gave order code that was given in notifications but order won't load and then have to replace order at payment window because order disappears. the app use to work decently but does not work anymore. McDonald's is an international multi-billion dollar company but can't pay tech enough to have a working app?","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":1,"review_date":"2025-09-11"},{"review":"Horrible. Can't even sign in. Where you click to log in, it asks for your email, and when you enter it, it says, \"this account already exists.\" YEAH, I KNOW IM TRYING TO SIGN IN. Ugh.","category":"Authentication\/Login","sentiment_std":"Negative","rating":1,"review_date":"2025-09-11"},{"review":"I wish so much they would change the inability to order ahead and just go in and grab it. My only reason for using it is there's a location in my subway station. I just want to order from the bus, grab my stuff, hop on the subway like I would with any other fast food app. Instead it won't put the order in until I'm in the store because McDonald's has to baby me too much to let me be okay with a 5 min old coffee. Also changed my location during checkout today - I fixed it, but still.","category":"UI\/UX","sentiment_std":"Negative","rating":2,"review_date":"2025-09-11"},{"review":"refuses to run on grapheneos","category":"Crashes\/Bugs","sentiment_std":"Neutral","rating":1,"review_date":"2025-09-11"},{"review":"keeps asking to that does not happen!!!","category":"Customer Support","sentiment_std":"Negative","rating":1,"review_date":"2025-09-11"},{"review":"totally useless. can't redeem any offer or points. doesn't work at kiosk for login. can't use while driving duh. can't cancel a qr code until it's used. can't use if in store internet connection is flaky. give me paper, that still works.","category":"Rewards\/Offers","sentiment_std":"Negative","rating":1,"review_date":"2025-09-11"},{"review":"code doesnt work so cant collect points","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":1,"review_date":"2025-09-11"},{"review":"can't redeem points, keeps asking for payment and then gives me an error.","category":"Payments","sentiment_std":"Negative","rating":1,"review_date":"2025-09-11"},{"review":"bugy","category":"Crashes\/Bugs","sentiment_std":"Neutral","rating":1,"review_date":"2025-09-11"},{"review":"food","category":"Delivery","sentiment_std":"Neutral","rating":5,"review_date":"2025-09-10"},{"review":"What a terrible, confounding app. Very poorly conceived and difficult to navigate. Payment doesn't work properly for some reason. Yeah, that was a really bad experience. Uninstalling!","category":"Payments","sentiment_std":"Negative","rating":1,"review_date":"2025-09-10"},{"review":"Annoys me when you launch the app, you need to launch also the code. It took so long and reloading didnt work and so I thought to restart my decivr but nope, its the app that was really slow. can this be more convenient to use like a permanent bar code or something fast and user friendly.","category":"Performance\/Speed","sentiment_std":"Negative","rating":3,"review_date":"2025-09-10"},{"review":"switched devices, reinstalled on pixel 10 pro. try to login, app sends email link, AWS link broken. Fix or give me a password ffs","category":"Authentication\/Login","sentiment_std":"Negative","rating":1,"review_date":"2025-09-10"},{"review":"I loved the workers and how they treated me and my family. they were really kind and asked about my day. the food was top notch and I will be recommending this to my friends I loved it. very clean!","category":"Feature Requests","sentiment_std":"Positive","rating":5,"review_date":"2025-09-09"},{"review":"fix your damn app Jesus Christ, I wish I could rate as zero as it has been so glitchy for over a month.","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":1,"review_date":"2025-09-09"},{"review":"an app made by thieves designed to snake people into additional purchases","category":"Payments","sentiment_std":"Negative","rating":1,"review_date":"2025-09-09"},{"review":"No longer works. Updated app, cannot log in. Entered email address, no email comes. Looked everywhere in all boxes including junk mail. Regardless, I don't think I'll be frequenting a business that values cheap foreign labor. Service and cleanliness has suffered as of late. I will be taking my business to establishments that still value the customer and employs local Canadians","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":1,"review_date":"2025-09-09"},{"review":"STOP CHANGING MY RESTAURANT LOCATION AUTOMATICALLY!","category":"Location\/Geolocation","sentiment_std":"Negative","rating":1,"review_date":"2025-09-09"},{"review":"Really don't like that the app automatically changes the chosen location. Extremely frustrating when you get to the location you chose and turns out that app changed it without my knowledge and I had to drive to a different location to pick up my order.","category":"Location\/Geolocation","sentiment_std":"Negative","rating":2,"review_date":"2025-09-08"},{"review":"good","category":"Rewards\/Offers","sentiment_std":"Positive","rating":5,"review_date":"2025-09-08"},{"review":"I don't understand how a company can have this much money and such a broken app. Every time I open it, it immediately force closes. Then I open it again and find that my last order is still in my cart and needs to be deleted before I can order something else. Also, the touch targets just feel off. Same with scrolling. Might be time to contract out to a new company, Ronald.","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":2,"review_date":"2025-09-07"},{"review":"pervasive app unbelievable you MUST share location for any features or use","category":"Location\/Geolocation","sentiment_std":"Neutral","rating":1,"review_date":"2025-09-07"},{"review":"changed my order location half way through, sat at the location waiting for 50$ worth of food. location I was at couldn't help me at all.","category":"Delivery","sentiment_std":"Negative","rating":1,"review_date":"2025-09-07"},{"review":"app is so slow","category":"Performance\/Speed","sentiment_std":"Negative","rating":1,"review_date":"2025-09-07"},{"review":"absolute garbage. keeps pulling up an order I thought about 6 months ago. keeps failing when trying to order for delivery when it comes Google payment time. there is nothing wrong with my stuff, despite what the morons at mcdicks will tell you. billion dollar company can't even put out a reliable app","category":"Payments","sentiment_std":"Negative","rating":1,"review_date":"2025-09-07"},{"review":"When I clicked the 'Dine-in' button, it loaded for a few minutes. Then error message appeared. I ordered at counter and paid cash. I found that my app meal had been charged an hour later. The manager refused to refund and told me to contact app support. App support replied that the bank would reverse the transaction within a few days. A week later, the bank completed the transaction from pending. Then I complained to the app again, but they still havn't responded yet since 2022.","category":"Refunds","sentiment_std":"Negative","rating":1,"review_date":"2025-09-07"},{"review":"this is just an app that gives you free food.","category":"Rewards\/Offers","sentiment_std":"Neutral","rating":5,"review_date":"2025-09-07"},{"review":"App is very awkward to use and poorly laid out. Poor design and they recently made it worse. whoever is running the online portion of mcdonalds must work for the competion!","category":"UI\/UX","sentiment_std":"Negative","rating":1,"review_date":"2025-09-07"},{"review":"don't work","category":"Crashes\/Bugs","sentiment_std":"Neutral","rating":1,"review_date":"2025-09-07"},{"review":"I have location service on when the app is in use but it seams to want to have all location services turned on - you just lost a customer due to untested feature rolling out to customers","category":"Location\/Geolocation","sentiment_std":"Negative","rating":1,"review_date":"2025-09-06"},{"review":"Not great when you change locations and places your order at a different location 😔 money wasted . Hope someone enjoyed it","category":"Payments","sentiment_std":"Negative","rating":2,"review_date":"2025-09-06"},{"review":"no matter what you try to order it says item unavailable","category":"Delivery","sentiment_std":"Negative","rating":1,"review_date":"2025-09-06"},{"review":"this app is complete garage. every time I use it, something goes wrong (does not clear old order, refuses to checkout, suddenly says item [cheese burger or something] is unavailable and you need to change your order.","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":1,"review_date":"2025-09-06"},{"review":"not bad points are pretty useful but if a location decides to reset their system you cannot pick up anything from that location and you waste points","category":"Location\/Geolocation","sentiment_std":"Negative","rating":2,"review_date":"2025-09-06"},{"review":"order was processed and confirmed (paid) on the app, arrived at the window and was told to pay again. I didn't want to do that, and I was in a rush so told them to cancel my order. they still processed it as if I got my order. when I contacted customer service they blamed the bank (banks don't leave charges on your account unless a company gives confirmation that uts valid) and told me to dispute the charge with the bank if it doesn't fall off. they want me to waste my time over $8.78. don't use","category":"Customer Support","sentiment_std":"Negative","rating":1,"review_date":"2025-09-06"},{"review":"ABSOLUTE GARBAGE APP NEVER WORKS","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":1,"review_date":"2025-09-06"},{"review":"absolute garbage app it never works","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":1,"review_date":"2025-09-06"},{"review":"poor performance, so laggy and slow","category":"Performance\/Speed","sentiment_std":"Negative","rating":1,"review_date":"2025-09-06"},{"review":"try to order delivery and not able to pay for delivery no payment processed","category":"Delivery","sentiment_std":"Negative","rating":1,"review_date":"2025-09-06"},{"review":"it doesnt work","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":1,"review_date":"2025-09-05"},{"review":"In general, I really like the app, but it constantly signs you out, so when you reach the restaurant, you have to re-sign in. The app used to keep you signed in for months, now I have to re-sign in every time I use it. The re-sign in process is easier than it used to be, but it still takes a couple minutes. When I'm doing this at the drive-thru speaker, I imagine it's not great for your service times. So much for fast food.","category":"Performance\/Speed","sentiment_std":"Neutral","rating":3,"review_date":"2025-09-04"},{"review":"this app sucks. Doesn't show the location in Lower Sackville, Nova Scotia.","category":"UI\/UX","sentiment_std":"Negative","rating":1,"review_date":"2025-09-03"},{"review":"mcdelivery person didn't deliver the order I placed, went back to mcdonalds with it, and canceled my order. the customer service team didn't give me anything for my trouble, and the money I used to order will take 3 days to refund. worst delivery team, worst customer service team","category":"Delivery","sentiment_std":"Negative","rating":1,"review_date":"2025-09-03"},{"review":"First time I reviewed this app was in 2018, 7 years later and it's still an unusable pile of garbage, I can place an order, then by the time I get there, the order reopened itself and so was not placed or sent through to the restaurant. Not to mention it's 2025, there is no valid reason that a multi billion dollar company should have an app that runs slower than any website on dial-up internet from the 90s. There needs to be a button for 0 stars, cause that is what this app deserves.","category":"Performance\/Speed","sentiment_std":"Negative","rating":1,"review_date":"2025-09-03"},{"review":"I love the points you get for the money you spend. The points add up quickly and decent food items to choose from as well. My opinion is they have great tasting 😉😘😭😘😘😘😘coffee. 👍","category":"Rewards\/Offers","sentiment_std":"Positive","rating":4,"review_date":"2025-09-03"},{"review":"terrible app always slow and freezing up, and they changed it so you can no longer cancel an order after pressing order (for no apparent reason)","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":1,"review_date":"2025-09-03"},{"review":"Prefacing this review with the caution that I don't actually think this app is that bad. However, it's removed much functionality over the past few months that make what used to be easy now a headache. Where I live I must pay an upcharge if I want a bag. Why is this no longer an option? Why does the app make me check my order multiple times before I can pick it up? The function to cancel mobile orders has been removed as well. Assuming these get fixed I will write a new review. But for now...","category":"UI\/UX","sentiment_std":"Negative","rating":1,"review_date":"2025-09-03"},{"review":"excellent except for the 3 kids by the table yip yapping while customers stood at the counter about 8, then a lovely young lady came to serve us! Felt sorry for the older woman getting the orders ready for counter w\/o any help!","category":"Rewards\/Offers","sentiment_std":"Positive","rating":5,"review_date":"2025-09-02"},{"review":"garbage, every single time I use my points for purchase the points get used up but I still pay full price...also the \"rewards and offers\" were just drinks for the last 2-3 months","category":"Rewards\/Offers","sentiment_std":"Negative","rating":1,"review_date":"2025-09-02"},{"review":"What a piece of crAPP. For years the McDonald's app has done this thing where it holds onto your previous order and you can't clear it. You can even add new food and it'll still give you an order previously in progress error. Besides being super annoying, this morning, despite clearing out the old order, it actually ordered the old order and not the new one. Like wow.","category":"UI\/UX","sentiment_std":"Negative","rating":1,"review_date":"2025-09-02"},{"review":"dumb, it has 2 levels of confirmation that won't even start your order unless you're already there.","category":"UI\/UX","sentiment_std":"Negative","rating":1,"review_date":"2025-09-02"},{"review":"Horrible. Bloated, slow, poorly designed. I literally only install this for dollar drink days and then uninstall every September. This + the change to the rewards points payout means likely never coming back.","category":"Performance\/Speed","sentiment_std":"Negative","rating":1,"review_date":"2025-09-02"},{"review":"ordered my food and drove 20 minutes, just to hit the \"i am here button\" and grt told nothing I ordered is available. (a mccrispy and quarter blt. and id have to go in and start over.","category":"Location\/Geolocation","sentiment_std":"Negative","rating":1,"review_date":"2025-09-02"},{"review":"experiencing problems with payment through app","category":"Payments","sentiment_std":"Negative","rating":3,"review_date":"2025-09-01"},{"review":"some time give it hard time to me, also when i add my points. it does not add as quick as expected. more or less not my points appear in my app.","category":"UI\/UX","sentiment_std":"Negative","rating":1,"review_date":"2025-09-01"},{"review":"Why is this app so horrible? It is the worst food app, period. Putting aside the stupid mandatory location requirements, the app is extremely slow and laggy. Unresponsive at the best of times, it often has errors that users cannot resolve. For example, the app for some reason allows you to add to cart, checkout and authorize payment on items that are not available (not just out of stock, but limited time not available anymore) only to decline to process the order in the drive through.","category":"Performance\/Speed","sentiment_std":"Negative","rating":1,"review_date":"2025-09-01"},{"review":"A okay","category":"Rewards\/Offers","sentiment_std":"Neutral","rating":5,"review_date":"2025-09-01"},{"review":"No offers anymore, especially delivery. Can't remove items from cart. Can only add 1 rcpt\/mth 4 pts. Need 2 open app twice, closes first time. Cnstnt nvr ending prblms, nvr been resolved after mnths\/yrs of complaints.","category":"Delivery","sentiment_std":"Negative","rating":1,"review_date":"2025-09-01"},{"review":"I give it to my kids","category":"Rewards\/Offers","sentiment_std":"Neutral","rating":5,"review_date":"2025-09-01"},{"review":"continually locked out of my account, can't sign in using password. must use email and email wasn't working so lost my whole mcd account and all my points. what a terrible app and a crocked company for stealing accounts.","category":"Authentication\/Login","sentiment_std":"Negative","rating":1,"review_date":"2025-08-31"},{"review":"that is can't order from a real mcdonals because it's 300 meter father then then half a mcdonals in the walmart what a joke","category":"Location\/Geolocation","sentiment_std":"Negative","rating":1,"review_date":"2025-08-31"},{"review":"Its not good its bad I hate this app don't get it there's uber eats and u can walk or drive so ya....","category":"Delivery","sentiment_std":"Negative","rating":1,"review_date":"2025-08-31"},{"review":"the app randomly work. every few visits to mcdinalds they tell me the code doesnt work. I close the app to refresh to get a new code but it doesnt produce a new code. I deleted the app for this reason but tried again 6 months later. same issie on my 3rd tome using the app.","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":1,"review_date":"2025-08-31"},{"review":"I used to have no problem now it won't let me order online anymore. I call the store for help and there isn't anything they can do. there's no support. such a waste of mcdonalds points if the delivery options don't work.","category":"Delivery","sentiment_std":"Negative","rating":1,"review_date":"2025-08-31"},{"review":"charges for orders that the app cancels","category":"Refunds","sentiment_std":"Neutral","rating":1,"review_date":"2025-08-30"},{"review":"good","category":"Rewards\/Offers","sentiment_std":"Positive","rating":5,"review_date":"2025-08-30"},{"review":"two stars is me being generous seriously don't bother with this, constantly broken, orders always glitch (but somehow I always get charged), this is just doordash wearing a different skin, with all the terrible customer service of doordash. Seriously just use Uber eats, it's not that much more expensive and you'll actually get your food when you're hungry and paid for it.","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":2,"review_date":"2025-08-30"},{"review":"Stop logging me out and forcing me to respond to an email to get back in. It isn't 1995 anymore","category":"Authentication\/Login","sentiment_std":"Negative","rating":2,"review_date":"2025-08-29"},{"review":"buggy And barely works","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":1,"review_date":"2025-08-29"},{"review":"DO NOT USE FOR DELIVERY! They delivered someone else's food to my house that cost half the price of my food and then refused to provide a refund.","category":"Delivery","sentiment_std":"Negative","rating":1,"review_date":"2025-08-29"},{"review":"don't send me notifications for items not on the menu. I already kinda hate you for removing the mighty mcgriddle, I don't need reminding 😂 supremely dumb that the order replaced on mobile doesn't get started until I'm at the store, it saves no time and just adds unnecessary steps.","category":"UI\/UX","sentiment_std":"Negative","rating":1,"review_date":"2025-08-28"},{"review":"Just rated down a star. Now removing and reinstalling doesn't help.🙁 One of the world's biggests corps, focused on efficiency, and it can't make an app that consistently works? When it works, it's fine, but far too many \"you need to temove and reinstall\" to fix issues. This is very disappointing. If their app is so dubious, what does it say about their main product: food?","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":3,"review_date":"2025-08-28"},{"review":"I don't put pmt card on here, had free items which were won with stamps, got charged for them I internet sucks. Phone gets stuck between wifi and data","category":"Rewards\/Offers","sentiment_std":"Negative","rating":1,"review_date":"2025-08-28"},{"review":"Doordash delivered my food to the wrong address and then denied me a refund despite the photo clearly showing someone else's house. Avoid this app and Doordash in general.","category":"Refunds","sentiment_std":"Negative","rating":1,"review_date":"2025-08-28"},{"review":"love it","category":"Rewards\/Offers","sentiment_std":"Positive","rating":5,"review_date":"2025-08-28"},{"review":"l redeemed my first reward today. An Egg Mcmuffin. my favorite breakfast","category":"Rewards\/Offers","sentiment_std":"Positive","rating":5,"review_date":"2025-08-28"},{"review":"Ever since the last update, this app has been close to useless. Constantly freezes and crashes, randomly decides not to recognize the system back button, and layouts that look like they've finished generating only to add a new button and shift the entire screen, causing accidental clicks on the wrong spot nearly every time I order. This app used to function extremely well, but any semblance of a well optimized program is now long gone.","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":1,"review_date":"2025-08-27"},{"review":"There have been no offers outside of dollar drinks days for the last 3 months","category":"Rewards\/Offers","sentiment_std":"Negative","rating":1,"review_date":"2025-08-27"},{"review":"App can be glitchy. I like that you can use coupons in the app or in store, but I dont like that you have to be on-site with the phone to check in. I can't order my kids' lunch from work and have them pick it up because I can not check in from my workplace.","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":2,"review_date":"2025-08-27"},{"review":"constantly freezing. saved orders do not work. takes forever to find anything.","category":"Refunds","sentiment_std":"Negative","rating":1,"review_date":"2025-08-27"},{"review":"This still doesn't have the option to add gift cards..","category":"Payments","sentiment_std":"Negative","rating":1,"review_date":"2025-08-27"},{"review":"nice food I like it. Basically I chose it.","category":"Rewards\/Offers","sentiment_std":"Positive","rating":5,"review_date":"2025-08-27"},{"review":"App won't let me order, keep getting message saying there is already an order in progress. When I click current order it goes back to the home screen and we start all over again. I will be uninstalling it.","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":1,"review_date":"2025-08-27"},{"review":"it wont even let me verify my email, guess im going to burgerking, now get this the points you collect all expire, the 15k I had are now reduced to 6k. why make a point system if I can't even use it. get real.","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":1,"review_date":"2025-08-26"},{"review":"trash","category":"Delivery","sentiment_std":"Negative","rating":1,"review_date":"2025-08-26"},{"review":"can't seem to login to my existing account 😪","category":"Authentication\/Login","sentiment_std":"Negative","rating":1,"review_date":"2025-08-26"},{"review":"Always delicious food or beverages.","category":"Rewards\/Offers","sentiment_std":"Positive","rating":5,"review_date":"2025-08-26"},{"review":"awesome app","category":"UI\/UX","sentiment_std":"Positive","rating":5,"review_date":"2025-08-26"},{"review":"app is slow and keeps restarting","category":"Performance\/Speed","sentiment_std":"Negative","rating":1,"review_date":"2025-08-26"},{"review":"Log me out at the most inconvenient time and block my relogin with a constant loop of email links that go nowhere. This will be my third new signup with a new\/ different email.","category":"UI\/UX","sentiment_std":"Negative","rating":1,"review_date":"2025-08-26"},{"review":"Horrible app. 4 years later and still continuous problems. latest issue is credit card payments not going through but it does not tell me. instead I find out when I go through drive through and get stopped at first window to make a payment again. staff in store don't explain why unless u ask and even then its not clear. it just happens sometimes. Head office....FIX IT please. whats the point of this app if I have to do a payment at the window??? old orders still in checkout bag. lags frequently.","category":"Payments","sentiment_std":"Negative","rating":1,"review_date":"2025-08-26"},{"review":"unable to change my email address in my profile.","category":"Rewards\/Offers","sentiment_std":"Negative","rating":1,"review_date":"2025-08-25"},{"review":"this is the second time it's happened, everything on my end was fine, I waited about 20 minutes and still didn't get my order to curbside. so I went in and they never received my order. So I can't say that I am overly thrilled with your App.","category":"Performance\/Speed","sentiment_std":"Negative","rating":2,"review_date":"2025-08-25"},{"review":"The app uses the last order location and no longer picks the most nearby location when ordering. This causes major inconveniences.","category":"Location\/Geolocation","sentiment_std":"Negative","rating":2,"review_date":"2025-08-25"},{"review":"it's gets jammed up and no one to help you sort anything out","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":1,"review_date":"2025-08-25"},{"review":"Manager at Humboldt store stated all mobile order payments are not going through on app this week. Tried to see order history in app for my Humboldt site number to email & that isn't working tried to email in and it reset because I didn't have the site number. Fix your app!!","category":"Payments","sentiment_std":"Negative","rating":2,"review_date":"2025-08-25"},{"review":"This app used to be 5 stars for myself, now it is a 0 star app. I'm able to make orders online but once I get to the drive through the app glitches and won't let my order go through. Half the time the people at the store can't find my order, it's frustrating and embarrassing. I won't allow my friends to drive through anymore as to save them the hassle of me flustered dealing with an app that doesn't work. So I am forced to physically go into the store which is not ideal. You've broken the app!😡","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":1,"review_date":"2025-08-25"},{"review":"Decent rewards not much flexibility though, pretty much pointless to moblie order considering it's the only food app where you cannot place the order fully until you're right beside the restaurant. The lack of new offers for likely going on close to a year now makes this app pretty much pointless, sure I can save 50 cents for a drink which is nice but they completely got rid of food coupons, what gives?","category":"Rewards\/Offers","sentiment_std":"Negative","rating":1,"review_date":"2025-08-25"},{"review":"garbage app. location doesnt work and orders dont get paid and you cant complain because the store locator doesnt work","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":1,"review_date":"2025-08-25"},{"review":"horrible!!! lousy, service is much more complicated than before. Longer waiting for your order 😔","category":"Payments","sentiment_std":"Negative","rating":1,"review_date":"2025-08-24"},{"review":"unable to use app to order food. says I have a \"ghost\" pre-existing order, which prevents me from ordering a new order. i see no way to fix it, as there is no existing order to go \"remove\". so I can't remove any pre-existing orders as there are no orders. therefore, I can't place mobile orders. fix this and I'll change back to 5*","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":1,"review_date":"2025-08-24"},{"review":"The app does not pick the correct restaurant for delivery. It always picks the food court vs the standalone, and the food court doesn't offer bundles & sharing items. The stand alone is not that much farther away, we're talking a couple hundred meters","category":"Delivery","sentiment_std":"Negative","rating":1,"review_date":"2025-08-24"},{"review":"The app worked great for years, but now I'm unable to log in. I've followed the steps, but it just sends me to a page that does nothing.","category":"Authentication\/Login","sentiment_std":"Negative","rating":3,"review_date":"2025-08-24"},{"review":"wasn't having a problem up until now.... Every time I attempt a mobile order I receive a message stating that I have an active order and to wait 1-2 minutes. The only problem is, I don't.... I've tried logging out, uninstalling the app, clearing the cache but I still have no luck. I The worst part, there's no one to communicate with for help!","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":3,"review_date":"2025-08-23"},{"review":"hasn't worked properly in over one month. emails to support are ignored","category":"Customer Support","sentiment_std":"Negative","rating":1,"review_date":"2025-08-23"},{"review":"bad","category":"Payments","sentiment_std":"Negative","rating":1,"review_date":"2025-08-23"},{"review":"This app is horrible and not efficient, it keeps changing my chosen location after order is submitted to Walmart locations that clearly are not drive-thru and not in the direction I am traveling. Then it leaves behind red lines that say remove where my order items used to be. Since McDonald's app is wasting my time, I take their time to fix my order while in the Drive-Thru. DO NOT RECOMMEND.","category":"Location\/Geolocation","sentiment_std":"Negative","rating":1,"review_date":"2025-08-23"},{"review":"Don't trust the \"my location \" for delivery. It is very inaccurate.","category":"Delivery","sentiment_std":"Negative","rating":1,"review_date":"2025-08-23"},{"review":"the app takes for ever to load. Too many adds.","category":"Performance\/Speed","sentiment_std":"Negative","rating":2,"review_date":"2025-08-23"},{"review":"They want people to download the app but there's never any decent offers","category":"Rewards\/Offers","sentiment_std":"Negative","rating":1,"review_date":"2025-08-23"},{"review":"dropping it to 1 until they stop defaulting to Walmart McDonald's in the app. I'm never ever going to Walmart. Why are you always forcing me to change this selection.","category":"UI\/UX","sentiment_std":"Negative","rating":1,"review_date":"2025-08-22"},{"review":"often buggy to the point of user breaking","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":3,"review_date":"2025-08-22"},{"review":"KEEPS CRASHING OUT, EVERY SINGLE TIME I OPEN IT.","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":1,"review_date":"2025-08-22"},{"review":"the app works maybe 50% of the time. it always makes you sign back in, glitches constantly. an embarrassment for a company this size","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":1,"review_date":"2025-08-22"},{"review":"slow to load. I'm waiting on line for a few minutes while this loads just to order deals that show up once every 2 months. worst app","category":"Performance\/Speed","sentiment_std":"Negative","rating":1,"review_date":"2025-08-21"},{"review":"no longer works or ordering. you can view menu bit it just will no longer process anything I order. if this continues I will delete as no point having it.","category":"UI\/UX","sentiment_std":"Negative","rating":1,"review_date":"2025-08-21"},{"review":"login me out every week is so annoying. fix your app. sure it has good deals most of the time but when I want to use it I have to go through steps use the deals. thats why 3stars. Also train your staff better.","category":"Authentication\/Login","sentiment_std":"Negative","rating":3,"review_date":"2025-08-21"},{"review":"says cant work. no server. my wifi and data both work. only option for sign in is email which doesnt work. no option to reset password online. only the app which isn't there??","category":"Authentication\/Login","sentiment_std":"Negative","rating":2,"review_date":"2025-08-21"},{"review":"Terrible, pick a recently less-price order and try to satisfied the requirement, but it has error during sides and deink choosing. ALWAYS doing again as a loop and cound not continue next step. Bad experience for food-order app ever Waste 30 minutes to do that! \/\/\/ Aug 2025 update Apps not working due to network? but other apps work well as usual.","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":1,"review_date":"2025-08-21"},{"review":"constant issues and frequent issues connecting to my account","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":1,"review_date":"2025-08-21"},{"review":"took money from my bank and says it didn't go through...I have screenshots","category":"Payments","sentiment_std":"Negative","rating":1,"review_date":"2025-08-21"},{"review":"App used to have good offers. Since earlier this year there are no longer any decent offers. Good to keep track of reward points but since the offers are gone I don't go to McDonald's much anymore.","category":"Rewards\/Offers","sentiment_std":"Negative","rating":2,"review_date":"2025-08-21"},{"review":"Worst App ever. Points should not expire and you should just be able to scan it like a Tim's card without needing a code. Also if it say Dollar drinks are ANY SIZE , then the restaurant a person deals with, should not be able to say 'it doesn't work like that here' when all you have to do is drive across town and it will work there. We enjoyed 3 generations of having coffee every morning up until covid hit but since then , the service is terrible and cost is astronomical. Too bad.","category":"Rewards\/Offers","sentiment_std":"Negative","rating":1,"review_date":"2025-08-21"},{"review":"I can't get it to work","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":4,"review_date":"2025-08-20"},{"review":"Update: Speed issues fixed. Changing to 4 stars from 1. Submitting a concern through this app is a joke. It stands to reason that a company that wants to achieve conformity across all its franchised locations would want to gather as much customer feedback (aka crowdsourced intelligence as possible.)","category":"Performance\/Speed","sentiment_std":"Negative","rating":4,"review_date":"2025-08-20"},{"review":"good app","category":"UI\/UX","sentiment_std":"Positive","rating":5,"review_date":"2025-08-20"},{"review":"This app is absolutely garbage. Doesn't work 90 perfect of the time. Either won't take your payment or says items are unavailable at this time which they aren't.","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":1,"review_date":"2025-08-20"},{"review":"good","category":"Rewards\/Offers","sentiment_std":"Positive","rating":5,"review_date":"2025-08-20"},{"review":"Moved over to Android for iPhone, app has no way to allow me to log back into my account. The contact us in this app also offers no way to reach out for app\/login support.","category":"Authentication\/Login","sentiment_std":"Negative","rating":1,"review_date":"2025-08-20"},{"review":"constantly doesn't work now. waits until you're in the parking lot then says there's an issue with an item in the bag.. so you pull over and try to figure it out and there's literally nothing you can do. have to clear the cache and start over. entirely ruins any sort of convenience of the app. useless.","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":1,"review_date":"2025-08-20"},{"review":"half the time it doesn't let me get points from my receipts it's giving me some kind of error","category":"Payments","sentiment_std":"Negative","rating":2,"review_date":"2025-08-20"},{"review":"great when it works, absolute nightmare to deal with when it doesnt, doesnt use default browser so log in button wont work unless you manually copy and paste it into something else, losing orders that then arent resolved for a day or so making it actually functionally unusable, half the time it auto selects closest location, half the time it just uses whatever the last one used was which makes the autoselect kinda redundant if you have to make sure it chose correct anyways","category":"Authentication\/Login","sentiment_std":"Negative","rating":3,"review_date":"2025-08-19"},{"review":"Horrible!!!","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":1,"review_date":"2025-08-19"},{"review":"cant order on the app since before the latrst update. why have a deal that requires the app or delivery and the app gives you no option to pay\/complete your order","category":"Payments","sentiment_std":"Negative","rating":1,"review_date":"2025-08-19"},{"review":"never works, freezes won't open, etc, etc,worst food app I've ever used. it sucks","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":1,"review_date":"2025-08-18"},{"review":"buggy as hell and only good for collecting points if it works.","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":1,"review_date":"2025-08-18"},{"review":"so many glitches it's actually insane. it's getting worse and worse too, usually developers clean up apps and make them better over time but somehow this has gotten so bad to the point where, at times, I cannot even place an order.","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":1,"review_date":"2025-08-18"},{"review":"wont save your cart and placing orders ahead of time results in an error which is the 2 things this app is useful for","category":"Delivery","sentiment_std":"Negative","rating":1,"review_date":"2025-08-18"},{"review":"Brutal. Can't order ahead and the app changes the location of your order without telling you. Waiting for a refund from an order that was never fulfilled. Will delete this app after the refund goes through.","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":1,"review_date":"2025-08-17"},{"review":"ordered delivery, like I have many times in the past. driver didn't deliver the order and they refused a refund, guess I'm paying for some door dash guys breakfast?? never again","category":"Delivery","sentiment_std":"Negative","rating":1,"review_date":"2025-08-17"},{"review":"app sucks. delivery defaults to nearest location in a Walmart with limited menu when a location slightly further with a full menu is not allowed. this means no McDonald's home delivery ever. it's probably for the best, we'll choose a better restaurant. the app is about as functional as their digital drive through menus.","category":"Delivery","sentiment_std":"Negative","rating":1,"review_date":"2025-08-16"},{"review":"😋😋😋😋","category":"Rewards\/Offers","sentiment_std":"Positive","rating":5,"review_date":"2025-08-16"},{"review":"First, whenever I open the app and try to use the code, 95% of the time it'll tell me the code is invalid, and it won't refresh. I'll exit the app, uninstall\/reinstall, and nothing helps. New phone didn't help at all. Second, the closest McDs location to me is at a Walmart, which doesn't offer the full menu. It won't allow delivery from a different location, so I can't order what I want. I tried contacting them, but continuously get redirected to multiple FAQ pages which are not helpful at all.","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":1,"review_date":"2025-08-16"},{"review":"The process to actually have a conversation about a bad experience is asine! They don't care!","category":"Customer Support","sentiment_std":"Negative","rating":1,"review_date":"2025-08-16"},{"review":"Despite app being up to date and payment info being accurate, tried 4 times to pay on app and just got error code. Finally worked by using kiosk. Colossal waste of time.","category":"Payments","sentiment_std":"Negative","rating":1,"review_date":"2025-08-16"},{"review":"App is completely unusable at Union Station in Toronto. Constantly switches between the McCafe upstairs and the McDonald's downstairs. Even after correcting the location several times during the order, it always tries to finalize the checkout at the McCafe upstairs, which does not have the full menu. In the end, the order gets stuck in a loop that can't be canceled or deleted until the app is forced closed and logged out.","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":1,"review_date":"2025-08-16"},{"review":"always paid failed","category":"Payments","sentiment_std":"Negative","rating":1,"review_date":"2025-08-16"},{"review":"app is difficult to place order. when I got to restaurant it told me one item wasn't available but didn't say which one. Continue button was greyed out. order from the kiosk in restaurant. would give 0 stars if I could","category":"UI\/UX","sentiment_std":"Negative","rating":1,"review_date":"2025-08-15"},{"review":"You would think that a multi-million (Billion) dollars Corporation could afford to pay a designer with some expertise and experience. My 11 year old could have created this app more effectively and efficiently.","category":"UI\/UX","sentiment_std":"Neutral","rating":1,"review_date":"2025-08-15"},{"review":"very glitchy piece of trash","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":1,"review_date":"2025-08-15"},{"review":"great app, love collecting points but the need more offers like 2 can dine","category":"Rewards\/Offers","sentiment_std":"Positive","rating":5,"review_date":"2025-08-15"},{"review":"only good to watch the dancing fries","category":"Rewards\/Offers","sentiment_std":"Positive","rating":2,"review_date":"2025-08-15"},{"review":"bag has items in it. when I select pick up option it says \"one or more items in you bag is unavailable\" I click on and takes me to my bag. says there's an error \"hamburglar caused some trouble....\" won't let me clear bag, pay for bag, I can add items to bag and that's it. haven't been able to make a mobile order for a month or 2 now, people at the counter or drive thru haven't been able to help either","category":"Payments","sentiment_std":"Negative","rating":1,"review_date":"2025-08-15"},{"review":"app work fine but do nothing for you other then collecting your data... no promo or deals of any kind for months... better just delete it","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":1,"review_date":"2025-08-15"},{"review":"I should give it less I find that when I'm ordering on line and I'm at the restaurant it often says there's no restaurant in my area it some how jumps of there wifi sending me to home office. and I'm in a Canadian app but when it works it works well","category":"Crashes\/Bugs","sentiment_std":"Neutral","rating":3,"review_date":"2025-08-15"},{"review":"trea mauvaise experience je commande a contrecoeur mais je me fais facturer a repentigny a quoi ca sert de choisir le mcdonald si lapplication decide par elle meme photo a lappuie","category":"UI\/UX","sentiment_std":"Neutral","rating":1,"review_date":"2025-08-14"},{"review":"It is bugging, changing my location after I ordered and cannot use the code functionality at the cashier","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":1,"review_date":"2025-08-14"},{"review":"Lol never works when using points, how is this billion dollar company not able to make a functioning app? Total and utter trash. UPDATE: 5 months later, same issues. Nice to see them living up to the quality of their food lol still garbage UPDATE 2: They use GPS to ensure the app does not work when you go to use it at the restaurant, so you can't get anything free with points. UPDATE 3: Still won't let me use points lol","category":"Location\/Geolocation","sentiment_std":"Negative","rating":1,"review_date":"2025-08-14"},{"review":"unable to place an order because it says I already have one when I dont","category":"Payments","sentiment_std":"Negative","rating":2,"review_date":"2025-08-14"},{"review":"trash deals since may. trash app.","category":"Rewards\/Offers","sentiment_std":"Negative","rating":1,"review_date":"2025-08-14"},{"review":"Is there some incompatibility with Samsung phones & this app?? If you're playing McD's giveaway\/games (ie Monopoly etc), you can win prizes but dont show up in yr profil?? Take screenshots of yr prize wins. Store mngrs are aware that app is glitchy, not working. Be prepared to explain\/argue with staff about this. FAIL! & Summer drink offers dont show up in app...when they do, u ant get to final confirmation. BIG FAIL! SAME ISSUE with redeem reward points, app has glitch loop. FAIL!!Uninstall it!","category":"Rewards\/Offers","sentiment_std":"Negative","rating":1,"review_date":"2025-08-13"},{"review":"The app is not working properly for me. it wouldn't accept my payment despite the fact that I have used it dozens of times. Now I have an order in the app, the payment won't work and I'm unable to delete the item from the bag and start again. I would delete the app and reload it, but I don't want to lose my points. so right now, I'm not a customer because the offer I want is only available on the app. Until you can fix this for me I won't be ordering from McDonalds.","category":"Payments","sentiment_std":"Negative","rating":1,"review_date":"2025-08-13"},{"review":"For one month every few months it will work and let me order food but the majority of the time it says card error and I will have to scan the codes at the store manually. I can change cards, try different logins. Makes no difference.","category":"Authentication\/Login","sentiment_std":"Negative","rating":2,"review_date":"2025-08-13"},{"review":"Hasn't worked in weeks. It keeps saying that I have items in my cart when I don't and it won't let me place an order.","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":1,"review_date":"2025-08-13"},{"review":"i really can't understand how an app can keep getting worse, ratings keep dropping but yet you do nothing to fix anything? why is it McDonald's struggles when the rest work fine? I've literally never had problems like this with any other phone app, ever. order sit and wait then boom your order just don't go thru. please start over. it's like 35 minute affair.","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":1,"review_date":"2025-08-13"},{"review":"app will not allow me to save or use a credit card, tried multiple cards all of which will not save. Google pay also disabled, credit card company says there is no restrictions on my cards. should be a pay at restaurant option since we have to be at the restaurant to place the order, for just scenario! app worked fine w cc until June 2025!","category":"Payments","sentiment_std":"Negative","rating":1,"review_date":"2025-08-13"},{"review":"too hard to navigate and slow AF!!!","category":"Performance\/Speed","sentiment_std":"Negative","rating":1,"review_date":"2025-08-13"},{"review":"For multi billion dollar company absolutely the worst app i have ever tried to use. No log in or password just a \"magic\" link from email that doesn't open the app. Horrible.","category":"Authentication\/Login","sentiment_std":"Negative","rating":1,"review_date":"2025-08-13"},{"review":"eat the mcrich","category":"Performance\/Speed","sentiment_std":"Neutral","rating":1,"review_date":"2025-08-12"},{"review":"horrible experience with app after having to sign in again - blocked the order from going through to the restaurant and got stuck in a hopping fry screen","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":2,"review_date":"2025-08-12"},{"review":"it constantly glitches and holds orders in the app. Which causes me to have to uninstall the app and reinstall for it to work. Or else its just stuck in the order and I can't open it, delete it, add to it or anything.","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":3,"review_date":"2025-08-12"},{"review":"Always loads incredibly slowly. No issues with any other apps ever.","category":"Performance\/Speed","sentiment_std":"Negative","rating":1,"review_date":"2025-08-12"},{"review":"wish to start allowing wifi numbers to.be acceptable for your codes you need and to be able to have yourself your own account details for your self-confidence and your account details to receive your discount immediately after everything you have done ordering from your place you love most Mc Donald's","category":"Rewards\/Offers","sentiment_std":"Positive","rating":5,"review_date":"2025-08-12"},{"review":"it hangs sometime","category":"Location\/Geolocation","sentiment_std":"Neutral","rating":4,"review_date":"2025-08-12"},{"review":"doesn't save much time","category":"Performance\/Speed","sentiment_std":"Negative","rating":1,"review_date":"2025-08-12"},{"review":"mcsauce it up:) it's happy day when u Mc play","category":"Rewards\/Offers","sentiment_std":"Positive","rating":5,"review_date":"2025-08-11"},{"review":"The app sent me to a different location, lost my order, and completely wasted my time.","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":1,"review_date":"2025-08-11"},{"review":"McDonald's rewards? more like McUseless' punishment😂😒","category":"Rewards\/Offers","sentiment_std":"Negative","rating":1,"review_date":"2025-08-11"},{"review":"You can't order ahead of time. Order can only be sent to the kitchen once location services determine you're at the restaurant, defeating the entire purpose of using the app to order.","category":"Location\/Geolocation","sentiment_std":"Negative","rating":1,"review_date":"2025-08-11"},{"review":"Easy as pie","category":"Rewards\/Offers","sentiment_std":"Positive","rating":4,"review_date":"2025-08-11"},{"review":"It never sends my order to the wrong store like other fast food apps. Sute there's room for improvement but ultimately it does most of what I need it to do. The UX could use improvement for helping sell me what I want more easily rather than making me go through the menu. Suggestions could be from my historical usage but I get that businesses have their own requirements separate from my goals as a user, but this app has come a long way. It used to really really suck lol but I'm here for it now","category":"UI\/UX","sentiment_std":"Negative","rating":4,"review_date":"2025-08-11"},{"review":"Very buggy","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":2,"review_date":"2025-08-10"},{"review":"app glitches when I try to pickup, days order timer out, store says \"we don't make the app\", can't order anymore.","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":1,"review_date":"2025-08-10"},{"review":"will not let me order. says I have a current order but doesnt show me anything","category":"Delivery","sentiment_std":"Negative","rating":1,"review_date":"2025-08-10"},{"review":"Good food","category":"Rewards\/Offers","sentiment_std":"Positive","rating":5,"review_date":"2025-08-10"},{"review":"app doesn't recognize \"I'm already here\" when you arrive at restaurants so you have to talk to staff to order. what's the point of app? waste of time.","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":2,"review_date":"2025-08-10"},{"review":"This app has become absolute dog feces. It used to be fairly reliable, and had decent offers available. Now I have to reinstall constantly, due to bugs and glitches that won't allow a mobile order to go through. Recently, there are times where it is completely unable to process payment, and the McDonald's staff refuses to apply the offer directly. McDonald's tries to push this app on us, and benefits from the ever lessening need for staff, but seems unable to maintain it. Failures.","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":1,"review_date":"2025-08-10"},{"review":"Broken completely. Order is frozen and can't interact.","category":"Delivery","sentiment_std":"Negative","rating":1,"review_date":"2025-08-10"},{"review":"Junk food, junk app","category":"Delivery","sentiment_std":"Negative","rating":1,"review_date":"2025-08-09"},{"review":"Update August 2025: what a nightmare of an app, extremely full of bugs. If you want to use this app, you will be forced to let them have full access to your location, which is absolutely unnecessary since I should be allowed to enter which restaurant I want to order\/use manually. Funny enough, this goes completely against their privacy policy and principles, since knowing my location is not necessary for them to have business with me.","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":1,"review_date":"2025-08-09"},{"review":"View current order not working","category":"UI\/UX","sentiment_std":"Negative","rating":1,"review_date":"2025-08-09"},{"review":"how can an app be so bad, so unrealiable... that is basically McDonald's app, a perfect example of how not to do an app..","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":1,"review_date":"2025-08-09"},{"review":"Great app, but you can't add a bag to your order!","category":"UI\/UX","sentiment_std":"Positive","rating":4,"review_date":"2025-08-08"},{"review":"can't get my location right? tells you I'm in the middle of nowhere about 200 km away from where I actually am and when you try to change it to where you are it tells you you're not at the store yet","category":"Location\/Geolocation","sentiment_std":"Negative","rating":1,"review_date":"2025-08-08"},{"review":"the app is garbage. it won't let you check out it just keeps giving the error 'check the items in your bag'","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":1,"review_date":"2025-08-08"},{"review":"so I didn't want to share my location do the app didn't recognize my codes until I did. talk about bullying customers to conform. mctyrant","category":"Location\/Geolocation","sentiment_std":"Negative","rating":1,"review_date":"2025-08-08"},{"review":"TERRIBLE APP. If I could give it ZERO, I would. One star I suppose for the poor girl at the window. She could care less of course, so I didn't complain further. This APP is always glitching, even if you restart the app multiple times. The code never works, which is super stressful at the drive-through. You can't even add your points after purchase. I rarely review and complain, but this is one of those occasions that I have to. of course, what did I expect from a fast food app. DO BETTER.","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":1,"review_date":"2025-08-08"},{"review":"Payment always fails when using the app now and my order never processes. Outside of this it's a good app, but I can't recommend something that's literally broken.","category":"Payments","sentiment_std":"Negative","rating":2,"review_date":"2025-08-08"},{"review":"Fast and accurate.","category":"Performance\/Speed","sentiment_std":"Positive","rating":5,"review_date":"2025-08-08"},{"review":"App suddenly crashed and I lost all of my accumulated awards","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":2,"review_date":"2025-08-08"},{"review":"Gouges their customers like the American company it is. Keep the boycott strong Canada! No need to give them $20 for a tiny burger.","category":"Payments","sentiment_std":"Negative","rating":1,"review_date":"2025-08-07"},{"review":"Takes FOREVER to load your unique code in the drive thru","category":"Performance\/Speed","sentiment_std":"Negative","rating":2,"review_date":"2025-08-07"},{"review":"This app is absolute garbage. We used it for months to place pickup orders and now no matter what we do we cannot place an order: \"something went wrong with your payment\". plenty of available funds, different payment methods tried, cache cleared and app restarted, phone restarted, uninstalled and reinstalled, new account created, notifications allowed incase there was 2FA. App is up to date, phone software is up to date. I work in tech support, I've done everything and nothing works.","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":1,"review_date":"2025-08-07"},{"review":"This app kinda sucks. Never any good offers, so I find little incentive to go.","category":"Rewards\/Offers","sentiment_std":"Negative","rating":1,"review_date":"2025-08-07"},{"review":"so the app had always been a bit buggy, but it was manageable. it would save your last order and not allow you to order anything. clearing cache and memory would fix this issue. essentially, resetting the app, which was slightly annoying. NOW, it's worse. it doesnt necessarily do that now, but they got rid of the \"Favorites \" tab, the rewards selection is annoying, and clicking reorder on a coffee during breakfast time supposedly isn't available during that time lol also super annoyingly slow","category":"Rewards\/Offers","sentiment_std":"Negative","rating":1,"review_date":"2025-08-07"},{"review":"Ever since they removed the option to favourite a customized option I've been so annoyed. I regularly order plain cheeseburgers and it was so nice to just click my favourite cheeseburger which was already customized to be plain. Now I have to manually remove all the items everytime I want a plain cheeseburger","category":"UI\/UX","sentiment_std":"Negative","rating":2,"review_date":"2025-08-07"},{"review":"The app is terrible. The staff know nothing about the app and it constantly says doesn't go through and then it bills.","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":1,"review_date":"2025-08-07"},{"review":"would be nice if I could order before I get there but instead they make you be in the parking lot so you still have to wait 10 mins for food... kinda defeats the point of the app","category":"UI\/UX","sentiment_std":"Negative","rating":1,"review_date":"2025-08-07"},{"review":"it's a weak and deficient app... when the silly app updates, I lose my info. Trucking annoying.","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":1,"review_date":"2025-08-07"},{"review":"usually works okay, although too many questions like bag or no. my complaint is that the app has locked up and I cannot order anymore, so I go to Tim Hortons now instead.","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":1,"review_date":"2025-08-07"},{"review":"Great","category":"Rewards\/Offers","sentiment_std":"Positive","rating":4,"review_date":"2025-08-06"},{"review":"always yummy and fresh and staff is friendly..","category":"Rewards\/Offers","sentiment_std":"Positive","rating":5,"review_date":"2025-08-06"},{"review":"easy to use","category":"UI\/UX","sentiment_std":"Positive","rating":5,"review_date":"2025-08-06"},{"review":"if I could have given it a -5 I would have. it has to be one of the worst apps I've ever used and I'm not even exaggerating. every time I use this app I want to chuck my phone away. how is it that Tim Hortons has a better app than you and you're worth way more as a company. they should honestly just remove this app for the stain that it puts on their company","category":"Delivery","sentiment_std":"Negative","rating":1,"review_date":"2025-08-06"},{"review":"You don't need my location to give me my code. I don't need you to tell me where the nearest location is where I'm literally sitting in the drive thru, trying to get the code from the app. All the while it has a melt down about not knowing where I am. Not only that but I've seen 30 year old cars that leak oil like a sieve run better than this app. It crashes, glitches, every time I open it.","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":1,"review_date":"2025-08-06"},{"review":"this app was once good but now I'm not sure what happened but it's not working properly and I have a lot of points and I can't redeem them now so that sucks","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":1,"review_date":"2025-08-06"},{"review":"functional but my favorite feature is how it crashes when you launch it 100% of the time and you have to open it again","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":2,"review_date":"2025-08-05"},{"review":"literally just doesnt work anymore, great update give the tech team raises for this one for real!","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":1,"review_date":"2025-08-05"},{"review":"inconsistent","category":"Crashes\/Bugs","sentiment_std":"Neutral","rating":1,"review_date":"2025-08-05"},{"review":"Whatever they did when they removed favourites made the app so slow I don't use it anymore.","category":"Performance\/Speed","sentiment_std":"Negative","rating":1,"review_date":"2025-08-05"},{"review":"it sucks big dark hot dogs. a little slow and clunky, and barely orders food. whether they make it right is the next story. No alternate forms of payment available (can't order with paying cash). Can't give lower than 1 star.🤦🏼","category":"Payments","sentiment_std":"Negative","rating":1,"review_date":"2025-08-05"},{"review":"the rewards arent big enough","category":"Payments","sentiment_std":"Negative","rating":3,"review_date":"2025-08-04"},{"review":"McDonalds makes TOO much money to have such a glitchy app. The mobile orders get stuck, it's slow generating codes to use to collect points, and I haven't seen any promos added to the app in a while outside of the usual summer $1 drinks, etc.","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":2,"review_date":"2025-08-04"},{"review":"I really enjoyed the Mc crispy chicken burger. It's the best I've tasted ever.","category":"Rewards\/Offers","sentiment_std":"Positive","rating":5,"review_date":"2025-08-04"},{"review":"I can't use your application.","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":1,"review_date":"2025-08-04"},{"review":"Absolutely a garbage app. I know 14 year old's that write code and apps that are beautiful and work as intended. NOTHING in this app works. Delete!!!","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":1,"review_date":"2025-08-04"},{"review":"The app only allows the mobile making the order to pickup (by using the location checking). I cannot order it on my mobile and ask others to pick it up for me. This is absolutely annoying and unnecessary!","category":"Location\/Geolocation","sentiment_std":"Negative","rating":1,"review_date":"2025-08-03"},{"review":"I don't even know where to start. The in app offers never work (allows me to add items up until checkout when it says they're ineligible), restaurants show up as open and able to take orders when they are in fact closed, extremely laggy and slow, constantly confuses previous orders with current orders, and absolutely no benefit anymore to ordering food in advance. why are things constantly getting worse?","category":"Performance\/Speed","sentiment_std":"Negative","rating":1,"review_date":"2025-08-03"},{"review":"doesn't work","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":1,"review_date":"2025-08-03"},{"review":"app is always bugging, even when I uninstall and reinstall it. plus, if something is wrong when my order is delivered, it's a trouble and a half to contact someone about it.","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":1,"review_date":"2025-08-03"},{"review":"problem with taking my order. used my points and said the screen froze. they not only took the points but charged for my meal","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":1,"review_date":"2025-08-03"},{"review":"waste of time. register, verify, order your food, wait, and then be told that order can't be processed for no reason given. Fail.","category":"Performance\/Speed","sentiment_std":"Negative","rating":1,"review_date":"2025-08-03"},{"review":"there never any deals for meals.om mine never.losing me as a custermor","category":"Rewards\/Offers","sentiment_std":"Negative","rating":1,"review_date":"2025-08-03"},{"review":"The points system is very difficult to understand and follow, it does not display an accurate daily balance ( like a good bank statement does). You might say that a bank statement will not show when your dollars ( points)expire. I say why have a system that has a points expiry date? I am sure McDonald's, if ending the system would give customers enough notice to \"use em or lose em\"! wouldn't they?*!* McDonald's so worried that a customer might accumulate a million points and bankrupt them ?","category":"UI\/UX","sentiment_std":"Negative","rating":3,"review_date":"2025-08-02"},{"review":"cash option would be great instead of card payments only. can't use the app at the drive thru with cash. it's weird! pls fix!","category":"Payments","sentiment_std":"Negative","rating":1,"review_date":"2025-08-02"},{"review":"and loving it","category":"Rewards\/Offers","sentiment_std":"Positive","rating":5,"review_date":"2025-08-02"},{"review":"The app changed my location of the store I was going to even after I confirmed the location of the store I wanted to go to, and it has happened twice for me now. It's super annoying. You guys need to fix this.","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":1,"review_date":"2025-08-02"},{"review":"this app is a total dumpster fire.","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":1,"review_date":"2025-08-02"},{"review":"always good service and good food","category":"Rewards\/Offers","sentiment_std":"Positive","rating":5,"review_date":"2025-08-01"},{"review":"no Google pay or PayPal useless","category":"Payments","sentiment_std":"Negative","rating":1,"review_date":"2025-08-01"},{"review":"There's a greater chance of Mozambique becoming a nuclear superpower than this app working properly.","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":1,"review_date":"2025-08-01"},{"review":"The app no longer works. I keep getting an error message to check the offer in my bag but there's no offer. I've cleared the cache, I've uninstalled and reinstalled and nothing. So, I just go to Wendy's instead!","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":1,"review_date":"2025-08-01"},{"review":"one of the worst ordering app I've ever seen. Geolocalization is abysmal. If there's an issue between cash at the restaurant and the app your order falls into limbo for way too long. navigation suck and everything feel sluggish.","category":"Location\/Geolocation","sentiment_std":"Negative","rating":1,"review_date":"2025-08-01"},{"review":"Never works!! 👎👎👎👎","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":1,"review_date":"2025-07-31"},{"review":"terrible sucks","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":1,"review_date":"2025-07-31"},{"review":"app bugged out and charged me but never sent the order through and still took my money. contacted support and due to the problem sent me to the manager of that mcdonalds who refused to acknowledge the problem and tried blaming it on the bank saying it's in the cloud despite the transaction being fully processed.","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":1,"review_date":"2025-07-31"},{"review":"Impossible to login because it never sends you the email code to login. Let us enter our damn passwords. Ridiculous. And no, it's not in the junk mail. No uninstalling the app isnt a solution.","category":"Authentication\/Login","sentiment_std":"Negative","rating":1,"review_date":"2025-07-31"},{"review":"used to be good. now it crashes every time I want to reopen my order.","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":3,"review_date":"2025-07-31"},{"review":"terrible and glitchy. always have to open it 2 times (closes automatically on first click). it now has an order stuck in my cart which I cannot delete, open or modify, so the app is essentially useless now.","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":1,"review_date":"2025-07-31"},{"review":"A billion dollar corporation can't get a simple app to work. I ordered my food and went to the curbside pickup hit finish and pay took my point and said something went wrong. No food no points. BS","category":"Payments","sentiment_std":"Negative","rating":1,"review_date":"2025-07-31"},{"review":"why can't you walk up to window when no cars present. ordered on mobile app but couldn't get order sense store front wasn't open yet. but if I had a scooter for example it would count. what a cruel and unfair world this is. 24 hrs only if you drive a car.","category":"Feature Requests","sentiment_std":"Negative","rating":1,"review_date":"2025-07-31"},{"review":"A constantly buggy experience. Second time in a row I've ordered, the app says order-in-queue, I select pickup type upon arrival, the kitchen gets the order but its not paid despite what the app says, app now says the order exists but also doesn't, and the clerk's advice is \"this is happening a lot, we will charge you again; you can request a refund in a few weeks if it double charged.\" Not a consumer-friendly experience, or a convenient one.","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":2,"review_date":"2025-07-31"},{"review":"Flat out doesn't work 99% of the time, always gives an error of some sort so it's useless.","category":"Location\/Geolocation","sentiment_std":"Negative","rating":1,"review_date":"2025-07-31"},{"review":"payment fails 90% of time and makes me pay at pick up","category":"Payments","sentiment_std":"Negative","rating":1,"review_date":"2025-07-30"},{"review":"Terrible User Experience. This app is extremely data intensive and, therefore, very slow. Also, every time I go to use it, it tells me I can not use the app without updating it. It takes less time to line up and wait than to use this poorly-designed app.","category":"UI\/UX","sentiment_std":"Negative","rating":1,"review_date":"2025-07-30"},{"review":"Even when I change the address to the preferred one, it randomly will decide to change it to the one it thinks is closest. Constantly end up ordering from the wrong location. How is it other apps can get it right, but not this one.","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":1,"review_date":"2025-07-30"},{"review":"never works can redeem any of my points and says there and offer in my cart when its there's not making it impossible to order","category":"Rewards\/Offers","sentiment_std":"Negative","rating":1,"review_date":"2025-07-30"},{"review":"McDonald's you can do better. Fix the bugs. I was always able to ask for a bag on the app when ordering now I cannot? What is up with that? I am also not happy with the fact that you do not give out napkins with an order. Come on McDonald's you can do better!!! I went through the drive-thru at restaurant #6136","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":1,"review_date":"2025-07-30"},{"review":"The app is slow, freezes, needs reloading, and especially when time is tight and timing critical. iPhone or android the app is unreliable all the way around.","category":"Performance\/Speed","sentiment_std":"Negative","rating":2,"review_date":"2025-07-29"},{"review":"It has gone from bad to worse. App automatically logged me out and now is not letting me login. I lost all my points. It is a scam","category":"Authentication\/Login","sentiment_std":"Negative","rating":1,"review_date":"2025-07-29"},{"review":"bad","category":"Payments","sentiment_std":"Negative","rating":1,"review_date":"2025-07-29"},{"review":"What I definitely don't like about the McDonald's app is that points expire. I ordered something on the app for pick-up paid for it got to the McDonald's the app didn't even recognize I was there in the drive-thru, I remember inputting my order number and it didn't recognize me, I had to go park my car and walk into the restaurant. You can't even change your password in the app it states online that you can do it in the profile section but there is no area for password.","category":"UI\/UX","sentiment_std":"Negative","rating":1,"review_date":"2025-07-29"},{"review":"McDonald's should be seriously embarrassed by this app. The glitches and errors are unbearable. It was faster to order food through the Burger King app and drive to get it than it was for this app to process my order.","category":"Performance\/Speed","sentiment_std":"Negative","rating":1,"review_date":"2025-07-28"},{"review":"useless.. never works","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":1,"review_date":"2025-07-28"},{"review":"it changed my location while submitting an order and double charged me, no option to cancel or get a refund.","category":"Refunds","sentiment_std":"Negative","rating":1,"review_date":"2025-07-28"},{"review":"What's the point of taking the time to order *in advance* through the app if the order will _not_ be prepared until you get to the drive-thru speaker","category":"Delivery","sentiment_std":"Neutral","rating":1,"review_date":"2025-07-28"},{"review":"Y'all do me right with coupons and points. No complaints. Just straight benefits.","category":"Rewards\/Offers","sentiment_std":"Positive","rating":5,"review_date":"2025-07-28"},{"review":"this app is so glitchy. Its happened often that ive had to pay at the window for pick up because my payment hasn't gone through for whatever reason. Today, the same scenario happened except they took the 6000 points I wanted to redeem, charged me for the rest of the order, but the restaurant couldn't find my order in the system so I left without my order. the employee said I had to go back through drive thru and put in the order again. How is this right?","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":1,"review_date":"2025-07-28"},{"review":"freezes constantly and works maybe 50% of the time on start-up.","category":"Crashes\/Bugs","sentiment_std":"Neutral","rating":2,"review_date":"2025-07-28"},{"review":"app has had no deals except 3 for months. 2 drinks and an ice-cream cone.","category":"Delivery","sentiment_std":"Negative","rating":1,"review_date":"2025-07-28"},{"review":"horrible deals. scam prices","category":"Payments","sentiment_std":"Negative","rating":1,"review_date":"2025-07-28"},{"review":"My app locked with an order in the bag, and now I cant delete my order, or my account","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":1,"review_date":"2025-07-27"},{"review":"I tried 3 times to place my order and have not been successful and I've tried deleting and re install the app 2 times and still problems placing my order and as well lost 6000 rewards points through this experience","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":1,"review_date":"2025-07-27"},{"review":"Love the current Summer Drink commercials on TV and ads online. Its funny, relatable and the vibe is positively amazing 👏","category":"Delivery","sentiment_std":"Positive","rating":5,"review_date":"2025-07-27"},{"review":"Why haven't my Loyalty Points shown up as I've entered them into the APP until I've called the customer service department much later, please? They went through the system, but they didn't show up until much later.","category":"Rewards\/Offers","sentiment_std":"Negative","rating":1,"review_date":"2025-07-27"},{"review":"This app is garbage.","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":1,"review_date":"2025-07-27"},{"review":"Its good when it works, but terrible customer service when resolving issues. We received someone else's order entirely and when we reported the problem, McDonald's refused to look into it further, no refund, no credit, nothing. They just gave excuses that their system won't allow them and so nothing they can do. When asked to speak with a manager, the manager is just as useless. They look to blame everyone else; oh it's Door Dash's problem, or oh it's the store's problem. Terrible service.","category":"Refunds","sentiment_std":"Negative","rating":1,"review_date":"2025-07-27"},{"review":"App is absolute garbage, bud. I tried logging into the app with my account so I could order lunch using McDelivery, and it sent me a link through gmail so I could log in without a password, and it wasn't working. So I tried sending a new link.. but they stopped sending the links entirely. Lost a 20$ sale from me, probably insignificant, but saves me money, eh","category":"Delivery","sentiment_std":"Negative","rating":1,"review_date":"2025-07-27"},{"review":"Since the new update, the app works surprisingly well now and i can order stuff.","category":"Payments","sentiment_std":"Positive","rating":5,"review_date":"2025-07-27"},{"review":"seriously the worst fast food app. please delete it and try again. I just placed my order and went through the drive thru, they asked \"what's your code\" so I had to unlock my phone and find the code, vs other restaurants I just say my name. then they tell me they can't find my order. I pull up to the window for help, they still can't find my order. they then find my order, it got sent to the front, and I have to go in and get it. why did I just spend 10 minutes in the drive thru.","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":1,"review_date":"2025-07-27"},{"review":"more than 14k points expired... what a joke. I'll just go to different restaurants from now on because I feel so disgusted by that.","category":"Rewards\/Offers","sentiment_std":"Negative","rating":1,"review_date":"2025-07-27"},{"review":"can't open to get code","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":1,"review_date":"2025-07-27"},{"review":"caught in a constant loop at checkout where it claims there's some update regarding items in my bag and then starts the checkout process all over and over and over again.","category":"Payments","sentiment_std":"Negative","rating":1,"review_date":"2025-07-27"},{"review":"cant dispute orders or any issues with food and cant even see past orders. absolute awful app. if they're going to send door dash drivers anyway, im going to order from doordash instead. at least they have some customer service","category":"Delivery","sentiment_std":"Negative","rating":1,"review_date":"2025-07-27"},{"review":"can't get app back back","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":1,"review_date":"2025-07-26"},{"review":"dose not fix my account the food is great but I cannot get back to oldest account","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":2,"review_date":"2025-07-26"},{"review":"almost never works","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":2,"review_date":"2025-07-26"},{"review":"Whenever you open the app it still thinks you are in the process of your previous completed order. Every time. Just let it go McDonald's. Learn to let it go. Edit: If anyone finds themselves stuck in that loop and unable to start a new order you have to log out then back in to clear the previous order. Otherwise you just endlessly get the hamburglar error.","category":"UI\/UX","sentiment_std":"Negative","rating":1,"review_date":"2025-07-26"},{"review":"it just don't work often and if it does it's extremely annoying.","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":2,"review_date":"2025-07-26"},{"review":"Needed to download and then update, instead of simply downloading the most recent version...","category":"Delivery","sentiment_std":"Neutral","rating":1,"review_date":"2025-07-26"},{"review":"Worst fast-food app by far. Slow to the point of being useless and constantly logs you out. Completely broken if you order ahead of time. When you get to the restaurant you'll be stuck in a loop unable to complete or cancel your order, requiring you to reinstall the app. You're a $200B company, do better. I award you no stars and may God have mercy on your soul.","category":"Performance\/Speed","sentiment_std":"Negative","rating":1,"review_date":"2025-07-25"},{"review":"keep saying I have an order in progress so I cannot make a new one. I tried clearing my cash and forced stopping it, still no luck. this is the bugiest app that I have on my phone. updated, still malfunctioning. It's not showing that I have any cart or open orders","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":1,"review_date":"2025-07-25"},{"review":"borderline useless. takes forever to load, keeps resetting location mid-order. generally unresponsive and clunky.","category":"Performance\/Speed","sentiment_std":"Negative","rating":1,"review_date":"2025-07-25"},{"review":"AWFUL since the last update. Did they hire a team of junior devs with 0 experience to work on this app??","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":1,"review_date":"2025-07-24"},{"review":"keep dropping order when I arrive to pick up, says payment didn't go through when I picking up, even when I switched cards, reinstall app, etc for the past half a year","category":"Payments","sentiment_std":"Negative","rating":1,"review_date":"2025-07-24"},{"review":"I'm in Edmonton and I have every fast food joint app available to me on my phone. The McDonald's app is by far the best, and it's not even close! I rarely have a problem, and if I do, it's usually a reboot of my phone or a small pause of the app that fixes any glitch. Sometimes I have to turn the Wi-Fi off on my phone before I even enter a McDonald's location, as it will automatically connect to theirs, and that can sometimes be down. But PLEASE, add syrup as a purchasable condiment on the app!","category":"Feature Requests","sentiment_std":"Positive","rating":5,"review_date":"2025-07-24"},{"review":"App previously worked well for ordering in advance. It consistently fails now in many ways. Whatever update happened a week or two ago broke it. The app is causing problems at pickup and likely frustrating staff in the restaurant to no end. From failing to make payments automatically, to sending orders to the front counter inexplicably rather than the drive through, to simply making orders disappear mysteriously. There is something broken inside this app now.","category":"Payments","sentiment_std":"Negative","rating":1,"review_date":"2025-07-24"},{"review":"cant even login now. it says continue with email but its for tegustration. no where can i login","category":"Authentication\/Login","sentiment_std":"Negative","rating":1,"review_date":"2025-07-24"},{"review":"I wish I could give this app 0 stars, unless changes your location and makes u miss your order, then gives no option to rectifi the situation, for such a big corporation, epic fail","category":"Crashes\/Bugs","sentiment_std":"Negative","rating":1,"review_date":"2025-07-23"},{"review":"can't login.","category":"Authentication\/Login","sentiment_std":"Negative","rating":1,"review_date":"2025-07-22"}]